logs/fio/blk/4M-4/4K2_s1_q4_4_v1_blk.log
randw-4K-n1-c1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
randw-4K-n2-c2: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n4-c4: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n8-c8: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n12-c12: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 27 processes

randw-4K-n1-c1: (groupid=0, jobs=1): err= 0: pid=1272: Wed Jul 24 14:58:30 2019
  write: IOPS=53.6k, BW=210MiB/s (220MB/s)(6286MiB/30001msec)
    slat (usec): min=2, max=757, avg= 3.07, stdev= 2.46
    clat (usec): min=228, max=1399, avg=590.88, stdev=92.02
     lat (usec): min=247, max=1403, avg=594.57, stdev=91.74
    clat percentiles (usec):
     | 10.000th=[  396], 20.000th=[  594], 30.000th=[  603], 40.000th=[  611],
     | 50.000th=[  619], 70.000th=[  627], 90.000th=[  644], 99.000th=[  676],
     | 99.900th=[ 1057], 99.990th=[ 1319], 99.999th=[ 1369]
   bw (  KiB/s): min=160037, max=357883, per=78.87%, avg=169212.19, stdev=36061.20, samples=59
   iops        : min=40009, max=89470, avg=42302.61, stdev=9015.28, samples=59
  lat (usec)   : 250=0.01%, 500=10.80%, 750=89.08%, 1000=0.01%
  lat (msec)   : 2=0.12%
  cpu          : usr=21.72%, sys=31.41%, ctx=1401115, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1609118,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n2-c2: (groupid=1, jobs=2): err= 0: pid=1277: Wed Jul 24 14:58:30 2019
  write: IOPS=51.5k, BW=201MiB/s (211MB/s)(6031MiB/30002msec)
    slat (usec): min=2, max=725, avg= 3.52, stdev= 2.25
    clat (usec): min=311, max=2449, avg=1237.07, stdev=70.20
     lat (usec): min=315, max=2452, avg=1241.27, stdev=70.00
    clat percentiles (usec):
     | 10.000th=[ 1205], 20.000th=[ 1221], 30.000th=[ 1221], 40.000th=[ 1237],
     | 50.000th=[ 1237], 70.000th=[ 1254], 90.000th=[ 1287], 99.000th=[ 1319],
     | 99.900th=[ 1598], 99.990th=[ 1942], 99.999th=[ 2040]
   bw (  KiB/s): min=89862, max=118017, per=44.26%, avg=91112.54, stdev=4178.22, samples=118
   iops        : min=22465, max=29504, avg=22777.81, stdev=1044.55, samples=118
  lat (usec)   : 500=0.01%, 750=0.51%, 1000=0.95%
  lat (msec)   : 2=98.52%, 4=0.01%
  cpu          : usr=11.88%, sys=17.37%, ctx=1479104, majf=0, minf=17
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1544007,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n4-c4: (groupid=2, jobs=4): err= 0: pid=1282: Wed Jul 24 14:58:30 2019
  write: IOPS=51.5k, BW=201MiB/s (211MB/s)(6032MiB/30003msec)
    slat (usec): min=2, max=729, avg= 5.18, stdev= 3.56
    clat (usec): min=318, max=4892, avg=2477.10, stdev=127.22
     lat (usec): min=333, max=4896, avg=2483.31, stdev=127.10
    clat percentiles (usec):
     | 10.000th=[ 2442], 20.000th=[ 2442], 30.000th=[ 2474], 40.000th=[ 2474],
     | 50.000th=[ 2507], 70.000th=[ 2507], 90.000th=[ 2540], 99.000th=[ 2606],
     | 99.900th=[ 2900], 99.990th=[ 3261], 99.999th=[ 4359]
   bw (  KiB/s): min=25849, max=68382, per=22.53%, avg=46375.78, stdev=10187.56, samples=240
   iops        : min= 6462, max=17095, avg=11593.60, stdev=2546.88, samples=240
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=1.39%, 4=98.60%, 10=0.01%
  cpu          : usr=7.97%, sys=11.13%, ctx=1055856, majf=0, minf=39
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1544243,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n8-c8: (groupid=3, jobs=8): err= 0: pid=1289: Wed Jul 24 14:58:30 2019
  write: IOPS=51.6k, BW=202MiB/s (212MB/s)(6052MiB/30005msec)
    slat (usec): min=2, max=746, avg= 8.16, stdev= 5.81
    clat (usec): min=413, max=9705, avg=4942.17, stdev=274.03
     lat (usec): min=435, max=9714, avg=4951.92, stdev=274.14
    clat percentiles (usec):
     | 10.000th=[ 4883], 20.000th=[ 4948], 30.000th=[ 4948], 40.000th=[ 4948],
     | 50.000th=[ 5014], 70.000th=[ 5014], 90.000th=[ 5080], 99.000th=[ 5145],
     | 99.900th=[ 5473], 99.990th=[ 6587], 99.999th=[ 9110]
   bw (  KiB/s): min=19113, max=27197, per=9.50%, avg=19612.12, stdev=1257.86, samples=472
   iops        : min= 4778, max= 6799, avg=4902.63, stdev=314.47, samples=472
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=1.78%, 10=98.21%
  cpu          : usr=6.24%, sys=7.80%, ctx=564008, majf=0, minf=81
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1549338,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n12-c12: (groupid=4, jobs=12): err= 0: pid=1300: Wed Jul 24 14:58:30 2019
  write: IOPS=51.7k, BW=202MiB/s (212MB/s)(6057MiB/30008msec)
    slat (usec): min=2, max=6814, avg=13.89, stdev=94.60
    clat (usec): min=445, max=19587, avg=7408.01, stdev=539.34
     lat (usec): min=450, max=19602, avg=7423.60, stdev=549.88
    clat percentiles (usec):
     | 10.000th=[ 7242], 20.000th=[ 7373], 30.000th=[ 7439], 40.000th=[ 7439],
     | 50.000th=[ 7439], 70.000th=[ 7504], 90.000th=[ 7570], 99.000th=[ 8225],
     | 99.900th=[12518], 99.990th=[15401], 99.999th=[18482]
   bw (  KiB/s): min=15569, max=22867, per=8.39%, avg=17343.57, stdev=791.11, samples=720
   iops        : min= 3892, max= 5716, avg=4335.61, stdev=197.77, samples=720
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=99.51%, 20=0.46%
  cpu          : usr=4.78%, sys=6.04%, ctx=467499, majf=0, minf=119
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1550540,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=210MiB/s (220MB/s), 210MiB/s-210MiB/s (220MB/s-220MB/s), io=6286MiB (6591MB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=201MiB/s (211MB/s), 201MiB/s-201MiB/s (211MB/s-211MB/s), io=6031MiB (6324MB), run=30002-30002msec

Run status group 2 (all jobs):
  WRITE: bw=201MiB/s (211MB/s), 201MiB/s-201MiB/s (211MB/s-211MB/s), io=6032MiB (6325MB), run=30003-30003msec

Run status group 3 (all jobs):
  WRITE: bw=202MiB/s (212MB/s), 202MiB/s-202MiB/s (212MB/s-212MB/s), io=6052MiB (6346MB), run=30005-30005msec

Run status group 4 (all jobs):
  WRITE: bw=202MiB/s (212MB/s), 202MiB/s-202MiB/s (212MB/s-212MB/s), io=6057MiB (6351MB), run=30008-30008msec

Disk stats (read/write):
  vda: ios=318/7787790, merge=0/0, ticks=64/25505320, in_queue=25509004, util=98.97%